ocs-debit-balance-new.xml


<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:bcs="http://www.huawei.com/bme/cbsinterface/bcservices"
                  xmlns:cbs="http://www.huawei.com/bme/cbsinterface/cbscommon"
                  xmlns:bcc="http://www.huawei.com/bme/cbsinterface/bccommon">
     <soapenv:Header/>
     <soapenv:Body>
       <bcs:FeeDeductionRequestMsg>
        <RequestHeader>
          <cbs:Version>1</cbs:Version>
          <cbs:BusinessCode>FeeDeduction</cbs:BusinessCode>
          <cbs:MessageSeq>%s</cbs:MessageSeq>
          <cbs:OwnershipInfo>
           <cbs:BEID>101</cbs:BEID>
          </cbs:OwnershipInfo>
          <cbs:AccessSecurity>
           <cbs:LoginSystemCode>%s</cbs:LoginSystemCode>
           <cbs:Password>%s</cbs:Password>
           <cbs:RemoteIP>127.0.0.1</cbs:RemoteIP>
          </cbs:AccessSecurity>
          <cbs:OperatorInfo>
           <cbs:OperatorID>%s</cbs:OperatorID>
          </cbs:OperatorInfo>
        </RequestHeader>
        <FeeDeductionRequest>
          <bcs:DeductSerialNo>%s</bcs:DeductSerialNo>
          <bcs:DeductObj>
           <bcs:SubAccessCode>
             <bcc:PrimaryIdentity>%s</bcc:PrimaryIdentity>
           </bcs:SubAccessCode>
          </bcs:DeductObj>
          <bcs:DeductInfo>
           <bcs:ChargeCode>C_FEE_DEDUCTION_CHARGE_CODE</bcs:ChargeCode>
           <bcs:ChargeAmt>%s</bcs:ChargeAmt>
           <bcs:CurrencyID>1049</bcs:CurrencyID>
          </bcs:DeductInfo>
          <bcs:AdditionalProperty>
           <bcc:Code>AdditionalInfo</bcc:Code>
           <bcc:Value>BMC_DEBIT</bcc:Value>
          </bcs:AdditionalProperty>
        </FeeDeductionRequest>
       </bcs:FeeDeductionRequestMsg>
     </soapenv:Body>
</soapenv:Envelope>
